app/Controllers/Home.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Mengambil data untuk grafik distribusi lokasi
        $lokasiData = $db->table('kriteria')
            ->select('nilai, COUNT(transaksi_properti.id_kriteria) as jumlah')
            ->join('transaksi_properti', 'kriteria.id = transaksi_properti.id_kriteria')
            ->where('kategori', 'Lokasi')
            ->groupBy('nilai')
            ->orderBy('jumlah', 'DESC')
            ->get()->getResultArray();

        // Format data agar bisa dibaca oleh Chart.js
        $chartLabels = [];
        $chartData = [];
        foreach ($lokasiData as $row) {
            $chartLabels[] = $row['nilai'];
            $chartData[] = $row['jumlah'];
        }

        $data = [
            'active_menu' => 'home',
            'total_properti' => $db->table('properti')->countAllResults(),
            'total_kriteria' => $db->table('kriteria')->countAllResults(),
---
SELECT `nilai`, COUNT(transaksi_properti.id_kriteria) as jumlah
FROM `kriteria`
JOIN `transaksi_properti` ON `kriteria`.`id` = `transaksi_properti`.`id_kriteria`
WHERE `kategori` = 'Lokasi'
GROUP BY `nilai`
ORDER BY `jumlah` DESC
SELECT COUNT(*) AS `numrows`
FROM `properti`
SELECT COUNT(*) AS `numrows`
FROM `kriteria`