app/Models/PropertiModel.php

    public function getPropertiWithKriteria()
    {
        // Menggunakan Query Builder untuk keamanan dan kemudahan
        return $this->db->table('properti p')
            ->select('p.id, p.nama_properti, GROUP_CONCAT(k.nilai ORDER BY k.kategori SEPARATOR ", ") as kriteria_list')
            ->join('transaksi_properti tp', 'p.id = tp.id_properti')
            ->join('kriteria k', 'tp.id_kriteria = k.id')
            ->groupBy('p.id, p.nama_properti')
            ->orderBy('p.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `p`.`id`, `p`.`nama_properti`, GROUP_CONCAT(k.nilai ORDER BY k.kategori SEPARATOR ", ") as kriteria_list
FROM `properti` `p`
JOIN `transaksi_properti` `tp` ON `p`.`id` = `tp`.`id_properti`
JOIN `kriteria` `k` ON `tp`.`id_kriteria` = `k`.`id`
GROUP BY `p`.`id`, `p`.`nama_properti`
ORDER BY `p`.`id` ASC